load File.join(
  ENV["HOME"],
  "Library/Mobile Documents/com~apple~CloudDocs",
  "dotfiles/setup/brewfile_extensions.rb"
)

tap "beeftornado/rmtree" # remove formula and all its (orphaned) dependencies

#== Basics ==
brew "git"
brew_if_tagged "git-flow"
brew "git-when-merged"
brew_if_tagged "git-standup"

cask "emacs"

#== Unix ==
brew "ncdu"
brew "openssl", pin: true

if tag? :tmux
  brew "reattach-to-user-namespace"
  brew "tmux"
  brew_gem "tmuxinator"
  brew_if_tagged "tmate"
end

#== Compilers ==
brew "gcc"

#== Heroku ==
if tag? :heroku
  brew "heroku/brew/heroku"
  brew "thoughtbot/formulae/parity" if tag?(:postgres) || tag?(:postgresql)
end

#== Utilities ==
brew "dockutil"
brew "hub"
brew "fzf" # used by `git co` alias
cask "betterzip"
cask my_formula("kdiff3")

#== Testing ==
cask_if_tagged my_formula("cypress")
brew "shellcheck"
brew "hadolint"

#== Programming languages and package managers ==
brew "libyaml", pin: true # should come after openssl

if tag? :ruby
  brew "rbenv"
  brew "ruby-build"
  brew "rbenv-default-gems"
  brew my_formula("rbenv-each"), args: ["HEAD"]
end

if tag? :node
  brew "nodenv"
  brew "yarn"
end

cask "java"
brew "python"

brew_if_tagged "elixir"
brew_if_tagged "go"

if tag? :clojure
  brew "leiningen"
  brew "rlwrap"
end

if tag? :react_native
  brew "watchman"
  cask "android-studio"
end

#== Databases ==
brew_if_tagged "sqlite", pin: true
cask_if_tagged "sequel-pro"

if tag?(:postgres) || tag?(:postgresql)
  cask "pgadmin4"
end

#== DevOps ==
brew_if_tagged "ansible", pin: true

if tag? :aws
  brew "awscli"
  cask "session-manager-plugin"
end

#== Browsers ==
cask "google-chrome"
cask "firefox"

#== Programming ==
cask "dash"
cask "iterm2"
cask "atom"
cask "sourcetree"
cask "xquartz"

if tag? :virtualbox
  cask "virtualbox"
  cask "virtualbox-extension-pack"
end

cask_if_tagged "cyberduck"
cask_if_tagged "docker"
cask_if_tagged "ngrok"

if tag?(:docker) && tag?(:codeclimate)
  brew "codeclimate/formulae/codeclimate"
end

brew_if_tagged "circleci"

brew_gem "autoterm"
brew_gem_if_tagged "mailcatcher"
brew_gem_if_tagged "rubocop"
brew_gem_if_tagged "ultrahook"

if tag?(:createk)
  brew_gem "relsr"
  brew_gem "flight_plan_cli"
end

#== Quicklook ==
cask "qlcolorcode" # syntax highlighting
cask "qlstephen" # files without extensions
cask "qlcommonmark" # markdown files
cask "quicklook-json"
cask "quicklook-csv"

#== Other apps ==
cask "1password"
cask "imageoptim"
cask "keepingyouawake"
cask "mollyguard"
cask "superduper"
cask "vlc"

cask_if_tagged "dropbox"
cask_if_tagged "filedrop"
cask_if_tagged "gimp"
cask_if_tagged "inkscape"
cask_if_tagged "postman"
cask_if_tagged "skype"
cask_if_tagged "slack"
cask_if_tagged "whatsapp"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages",   id: 409201541
