load File.join(
  ENV["HOME"],
  "Library/Mobile Documents/com~apple~CloudDocs",
  "dotfiles/setup/brewfile_extensions.rb"
)

tap "homebrew/services" if tag?(:memcached) || tag?(:redis)
tap "caskroom/cask"
tap "beeftornado/rmtree" # remove formula and all its (orphaned) dependencies

#== Unix ==
if tag? :ctags
  brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
end

brew "git"
brew_if_tagged "git-flow"
brew "git-when-merged"
brew_if_tagged "git-standup"
brew "jq"
brew "ncdu"
brew "nmap"
brew "openssl", pin: true
brew "pidof"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew_if_tagged "tmate"
brew "vim"
brew "zsh"
cask "emacs"

#== Compilers ==
brew "gcc"

if tag? :old_gcc
  brew "apple-gcc42"
  brew "gcc@4.8"
end

#== Heroku ==
if tag? :heroku
  brew "heroku/brew/heroku"
  brew "parity"
end

#== Utilities ==
brew "dockutil"
brew "hub"
brew "mackup"
brew "fzf" # used by `git co` alias
cask "kdiff3"

#== Image manipulation ==
brew_if_tagged "imagemagick", pin: true
brew_if_tagged "batik"

#== Testing ==
brew "qt@5.5" if tag?(:qt) && MacOS::Xcode.installed?
brew_if_tagged "phantomjs", pin: true
brew "shellcheck"
brew "hadolint"
brew_if_tagged "bats"

#== Programming languages and package managers ==
brew "libyaml", pin: true # should come after openssl

if tag? :ruby
  brew "rbenv"
  brew "ruby-build"
  brew "rbenv-default-gems"
  brew "rbenv-each", args: ["HEAD"]
end

if tag? :node
  brew "nodenv"
  brew "yarn", args: ["without-node"] # node is provided by nodenv
end

cask "java"
brew "python"

brew_if_tagged "elixir"
brew_if_tagged "go"

if tag? :clojure
  brew "leiningen"
  brew "rlwrap"
end

if tag? :react_native
  brew "watchman"
  cask "android-studio"
end

#== Databases ==
brew_if_tagged "sqlite", pin: true

brew_if_tagged "mysql", pin: true
cask_if_tagged "sequel-pro"

if tag?(:postgres) || tag?(:postgresql)
  brew "petere/postgresql/postgresql-9.4"
  brew "pex"

  cask "pgadmin3"
end

brew_if_tagged "memcached", pin: true
brew_if_tagged "mongodb", service_restart: :changed, pin: true
brew_if_tagged "redis", service_restart: :changed, pin: true

#== DevOps ==
brew_if_tagged "ansible", pin: true

if tag? :aws
  brew "awscli"
  cask "session-manager-plugin"
end

if tag? :linode
  brew "linode/cli/linode-cli"
end

#== Browsers ==
cask "google-chrome"
cask "firefox"
cask "flash-ppapi" # for Chromium/Opera
# cask "flash-npapi" # for Safari/Firefox

#== Programming ==
cask "dash"
cask "iterm2"
cask "atom"
cask "sourcetree"
cask "xquartz"

if tag? :virtualbox
  cask "virtualbox"
  cask "virtualbox-extension-pack"
end

cask_if_tagged "cyberduck"
cask_if_tagged "docker"
cask_if_tagged "ngrok"

if tag?(:docker) && tag?(:codeclimate)
  brew "codeclimate/formulae/codeclimate"
end

brew_if_tagged "circleci"

brew_gem "autoterm"
brew_gem "tmuxinator"
brew_gem_if_tagged "mailcatcher"
brew_gem_if_tagged "rubocop"
brew_gem_if_tagged "ultrahook"

if tag?(:createk)
  brew_gem "relsr"
  brew_gem "flight_plan_cli"
end

#== Quicklook ==
cask "qlcolorcode" # syntax highlighting
cask "qlstephen" # files without extensions
cask "qlcommonmark" # markdown files
cask "quicklook-json"
cask "quicklook-csv"
cask "betterzipql"

#== Other apps ==
cask "imageoptim"
cask "skype"
cask "mollyguard"
cask "superduper"
cask "vlc"

cask_if_tagged "1password"
cask_if_tagged "dropbox"
cask_if_tagged "filedrop"
cask_if_tagged "gimp"
cask_if_tagged "hipchat"
cask_if_tagged "inkscape"
# cask           "karabiner-elements" if tag? :karabiner
cask_if_tagged "keepingyouawake"
cask_if_tagged "lastpass"
cask_if_tagged "logitech-control-center"
cask           "music-manager" if tag? :itunes
cask_if_tagged "postman"
cask_if_tagged "seashore"
cask_if_tagged "slack"
cask_if_tagged "whatsapp"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages",   id: 409201541
